{
  "page_title": "55 No title found",
  "url": "https://www.thrillophilia.com/things-to-do-in-pune",
  "total_attractions": 33,
  "scraped_at": "2025-11-02 16:36:49",
  "attractions": [
    {
      "id": "9222",
      "number": "01",
      "title": "Camping near Pawna Lake",
      "content": {
        "paragraphs": [
          "With such beautiful attractions like Pawna Lake, you don’t have to think too much about what to do in Pune! The lake, located on the old Mumbai-Pune highway, is a must-visit camping spot. This artificial lake has been created from the waters flowing from Pawna Dam.Spending a couple of days in the wilderness is a great way to disconnect yourself from your routine life. Spend time gazing at the vast lush countryside and try to spot exotic birds. Indulge in water sports like kayaking, boating, and rafting.The day doesn’t end here. One of the bestthings to do in Pune at night is to spend time around a bonfire under the starry skies at the banks of the lake. Enjoy barbecued food and music and you round off the day with your friends.Location:Pawna Dam, Pune DistrictAlso Checkout:Places To Visit In Gold Coast"
        ],
        "spans": [
          "Spending a couple of days in the wilderness is a great way to disconnect yourself from your routine life. Spend time gazing at the vast lush countryside and try to spot exotic birds. Indulge in water sports like kayaking, boating, and rafting.",
          "The day doesn’t end here. One of the best",
          ".Location:Pawna Dam, Pune District"
        ],
        "full_text": "With such beautiful attractions like Pawna Lake, you don’t have to think too much about what to do in Pune! The lake, located on the old Mumbai-Pune highway, is a must-visit camping spot. This artificial lake has been created from the waters flowing from Pawna Dam.Spending a couple of days in the wilderness is a great way to disconnect yourself from your routine life. Spend time gazing at the vast lush countryside and try to spot exotic birds. Indulge in water sports like kayaking, boating, and rafting.The day doesn’t end here. One of the bestthings to do in Pune at night is to spend time around a bonfire under the starry skies at the banks of the lake. Enjoy barbecued food and music and you round off the day with your friends.Location:Pawna Dam, Pune DistrictAlso Checkout:Places To Visit In Gold Coast Spending a couple of days in the wilderness is a great way to disconnect yourself from your routine life. Spend time gazing at the vast lush countryside and try to spot exotic birds. Indulge in water sports like kayaking, boating, and rafting. The day doesn’t end here. One of the best .Location:Pawna Dam, Pune District"
      },
      "link": "https://www.thrillophilia.com/destinations/goldcoast/places-to-visit"
    },
    {
      "id": "12900",
      "number": "02",
      "title": "Visit Shaniwar Wada Palace",
      "content": {
        "paragraphs": [
          "While you are visitingPune attractions,Shanivar Wada Palace is a must see attraction. With the beauty of the palace, it is also known as a haunted place. Shaniwarwada is a royal residence fortress in the Pune city of Maharashtra. It was worked in the eighteenth century by the Peshwas of the Maratha Empire. It is a standout amongst the most went by authentic places in Maharashtra.",
          "As much as it is known for its verifiable significance it is likewise known for its spookiness. The real history of this fort is imperfect with a grisly murder following political yearning and covetousness. The dividers of this post have seen an awful story of the foul play, and its imprints still stay as a phantom, as yet waiting in this place. Shaniwarwada is known to be a standout amongst the spookiest places in India.",
          "For the perplexing, Teak was foreign from the wildernesses of Junnar, Stones were brought from Chinchwad, and Limestone from the belts of Jejuri. There is also a light and sound show held here every evening.",
          "Timings:Opens from 7:00 Am – 6:00 PM.",
          "Price:The approximate cost for the entrance is Rs 5 per person.",
          "Location:Shanivar Wada Place is located at 481, Shreemant Thorle Bajirav Peshve Rd, Shaniwar Peth, Pune, Maharashtra 411030You Can Checkout Great Discounts OnKids Activities Singapore"
        ],
        "spans": [],
        "full_text": "While you are visitingPune attractions,Shanivar Wada Palace is a must see attraction. With the beauty of the palace, it is also known as a haunted place. Shaniwarwada is a royal residence fortress in the Pune city of Maharashtra. It was worked in the eighteenth century by the Peshwas of the Maratha Empire. It is a standout amongst the most went by authentic places in Maharashtra. As much as it is known for its verifiable significance it is likewise known for its spookiness. The real history of this fort is imperfect with a grisly murder following political yearning and covetousness. The dividers of this post have seen an awful story of the foul play, and its imprints still stay as a phantom, as yet waiting in this place. Shaniwarwada is known to be a standout amongst the spookiest places in India. For the perplexing, Teak was foreign from the wildernesses of Junnar, Stones were brought from Chinchwad, and Limestone from the belts of Jejuri. There is also a light and sound show held here every evening. Timings:Opens from 7:00 Am – 6:00 PM. Price:The approximate cost for the entrance is Rs 5 per person. Location:Shanivar Wada Place is located at 481, Shreemant Thorle Bajirav Peshve Rd, Shaniwar Peth, Pune, Maharashtra 411030You Can Checkout Great Discounts OnKids Activities Singapore"
      },
      "link": "https://www.thrillophilia.com/destinations/pune/places-to-visit"
    },
    {
      "id": "27197",
      "number": "04",
      "title": "Chill at Cafe Paashh",
      "content": {
        "paragraphs": [
          "Spending time in the calm and warm ambience of Café Paashh, located in Kalyani Nagar, is one of the best things to do in Pune.  This charming café was actually an old bungalow that was restored as this multi-concept store including a boutique that offers sustainable fashion and an organic food restaurant. There is an open rooftop dining space perfect for catching a bit of sunshine or enjoying the evening hours, one of the best things to do in Pune at night.The menu has been created by celebrity chef Ajay Chopra and includes amazing organic & fusion foods. Don’t miss to try the artisanal ice creams, Buddha bowls, tacos, charred pumpkin kebabs, etc. The café is dotted with potted plants, quaint furniture, and quirky artworks. Don’t miss to browse through the wonderful books kept here as you enjoy your meal.Location:Kalyani Nagar, PuneTimings:11.00 AM to 11.00 PMAlso Checkout & Book:Day Trips From Florence"
        ],
        "spans": [
          "The menu has been created by celebrity chef Ajay Chopra and includes amazing organic & fusion foods. Don’t miss to try the artisanal ice creams, Buddha bowls, tacos, charred pumpkin kebabs, etc. The café is dotted with potted plants, quaint furniture, and quirky artworks. Don’t miss to browse through the wonderful books kept here as you enjoy your meal.",
          "Kalyani Nagar, Pune",
          "Also Checkout & Book:"
        ],
        "full_text": "Spending time in the calm and warm ambience of Café Paashh, located in Kalyani Nagar, is one of the best things to do in Pune.  This charming café was actually an old bungalow that was restored as this multi-concept store including a boutique that offers sustainable fashion and an organic food restaurant. There is an open rooftop dining space perfect for catching a bit of sunshine or enjoying the evening hours, one of the best things to do in Pune at night.The menu has been created by celebrity chef Ajay Chopra and includes amazing organic & fusion foods. Don’t miss to try the artisanal ice creams, Buddha bowls, tacos, charred pumpkin kebabs, etc. The café is dotted with potted plants, quaint furniture, and quirky artworks. Don’t miss to browse through the wonderful books kept here as you enjoy your meal.Location:Kalyani Nagar, PuneTimings:11.00 AM to 11.00 PMAlso Checkout & Book:Day Trips From Florence The menu has been created by celebrity chef Ajay Chopra and includes amazing organic & fusion foods. Don’t miss to try the artisanal ice creams, Buddha bowls, tacos, charred pumpkin kebabs, etc. The café is dotted with potted plants, quaint furniture, and quirky artworks. Don’t miss to browse through the wonderful books kept here as you enjoy your meal. Kalyani Nagar, Pune Also Checkout & Book:"
      },
      "link": "https://www.thrillophilia.com/day-trips-from-florence"
    },
    {
      "id": "12899",
      "number": "05",
      "title": "Visit Aga Khan Palace",
      "content": {
        "paragraphs": [
          "Also called the Gandhi National Museum and is a piece of Indian freedom struggle The Aga Khan Palace is anothermust visit place for you near Pune.  This is another of the best things to do in Pune. It filled in as a jail for national pioneers like Mahatma Gandhi amid the Quit India Movement in 1942.The Aga Khan Palace was given to India by Aga Khan IV amid 1969. The exhibition hall additionally fills in as a commemoration wherein the remaining parts (samadhi) of Mahatma Gandhi and his wife Kasturba Gandhi.",
          "The royal residence was worked in 1892 by Sultan Mohammed Shah, Aga Khan III. The royal residence involves five corridors and extensive verandahs. Admire the amazing architecture of the palace as you walk through the palace lanes. Despite the fact that the castle is compositionally Islamic yet it incorporates clues of Italian workmanship with many curves. The royal residence additionally contains an exhibition which has assets of Gandhiji like garments, footwear and a couple of something beyond. The royal residence is arranged on Nagar Road in Kalyani Naga.",
          "Timings:Opens from 9:00 AM – 05:45 PM.",
          "Price:The approximate price for the palace cost around Rs 5 for adults and Rs 2 for children.",
          "Location:Aga Khan Palace is located at Pune Nagar Road, Kalyani Nagar, Pune, Maharashtra 411014Click Here to Book Now:St. Peter's Basilica Tickets"
        ],
        "spans": [
          "Click Here to Book Now:"
        ],
        "full_text": "Also called the Gandhi National Museum and is a piece of Indian freedom struggle The Aga Khan Palace is anothermust visit place for you near Pune.  This is another of the best things to do in Pune. It filled in as a jail for national pioneers like Mahatma Gandhi amid the Quit India Movement in 1942.The Aga Khan Palace was given to India by Aga Khan IV amid 1969. The exhibition hall additionally fills in as a commemoration wherein the remaining parts (samadhi) of Mahatma Gandhi and his wife Kasturba Gandhi. The royal residence was worked in 1892 by Sultan Mohammed Shah, Aga Khan III. The royal residence involves five corridors and extensive verandahs. Admire the amazing architecture of the palace as you walk through the palace lanes. Despite the fact that the castle is compositionally Islamic yet it incorporates clues of Italian workmanship with many curves. The royal residence additionally contains an exhibition which has assets of Gandhiji like garments, footwear and a couple of something beyond. The royal residence is arranged on Nagar Road in Kalyani Naga. Timings:Opens from 9:00 AM – 05:45 PM. Price:The approximate price for the palace cost around Rs 5 for adults and Rs 2 for children. Location:Aga Khan Palace is located at Pune Nagar Road, Kalyani Nagar, Pune, Maharashtra 411014Click Here to Book Now:St. Peter's Basilica Tickets Click Here to Book Now:"
      },
      "link": "https://www.thrillophilia.com/places-to-visit-near-pune"
    },
    {
      "id": "12898",
      "number": "06",
      "title": "Experience The ‘Art of Living’ At The Osho Ashram",
      "content": {
        "paragraphs": [
          "After a long tiring week of work and meeting deadlines, you would definitely want to revive yourself. If you are looking for some refreshing time than Osho Ashram is a must visit for you.  Calm your fretful personality, seek inner peace and meditate in tranquillity while you visit this amazing place. The cool aura of the whole place and calm ambience, burbling waters and the angelic sound of birds add to this blissful experience.",
          "As the brainchild of Bhagwan Rajneesh, the Osho Ashram resounds the lessons and reasoning of Osho. Sprawling crosswise over 32 section of land of land, the ashram incorporates a perfectly kept up stop known as Nulla Park or Osho Teerth. The Osho Ashram offers courses like Osho Nataraj contemplation, Osho dynamic reflection, Osho Nadabrahma contemplation and Osho Kundalini reflection.",
          "Despite the fact that the courses are chargeable yet they offer an extraordinary otherworldly and serene experience. Bring back that peace of mind as you spend some time at this ashram.  One can also find a few guesthouses here where you can stay here for the night. There are a lot of courses which are offered here for meditation.",
          "Timings:Opens from 9:00 AM – 4:00 Pm.",
          "Price:The approximate price for meditation Indians Rs.760 and for Foreigners: Rs.1560 per day",
          "Location:Osho Ashram is located at 17, Koregaon Park Road, Vasani Nagar, Koregaon Park, Pune, Maharashtra 411001Also Checkout:London Eye Tickets"
        ],
        "spans": [],
        "full_text": "After a long tiring week of work and meeting deadlines, you would definitely want to revive yourself. If you are looking for some refreshing time than Osho Ashram is a must visit for you.  Calm your fretful personality, seek inner peace and meditate in tranquillity while you visit this amazing place. The cool aura of the whole place and calm ambience, burbling waters and the angelic sound of birds add to this blissful experience. As the brainchild of Bhagwan Rajneesh, the Osho Ashram resounds the lessons and reasoning of Osho. Sprawling crosswise over 32 section of land of land, the ashram incorporates a perfectly kept up stop known as Nulla Park or Osho Teerth. The Osho Ashram offers courses like Osho Nataraj contemplation, Osho dynamic reflection, Osho Nadabrahma contemplation and Osho Kundalini reflection. Despite the fact that the courses are chargeable yet they offer an extraordinary otherworldly and serene experience. Bring back that peace of mind as you spend some time at this ashram.  One can also find a few guesthouses here where you can stay here for the night. There are a lot of courses which are offered here for meditation. Timings:Opens from 9:00 AM – 4:00 Pm. Price:The approximate price for meditation Indians Rs.760 and for Foreigners: Rs.1560 per day Location:Osho Ashram is located at 17, Koregaon Park Road, Vasani Nagar, Koregaon Park, Pune, Maharashtra 411001Also Checkout:London Eye Tickets"
      },
      "link": "https://www.thrillophilia.com/tours/london-eye-entry-tickets"
    },
    {
      "id": "20678",
      "number": "07",
      "title": "Bazaar Walk through Pune Kasba",
      "content": {
        "paragraphs": [
          "It has markets, temples, and places of cultural, religious and historical significance. The Shaniwar Wada was originally a grand palace where the Peshwas lived and looks very much like a fort. The original Lal Mahal (palace) was the residence of Shivaji Bhonsle/Chhatrapati Shivaji Maharaj, and today its replica is seen here.",
          "The Nana Wada, made of wood, was the Peshwas’ administrator/Nana Phadnavis’ estate and illustrates the beauty and style of Peshwa-architecture. The Vishrambaug Wada, originally Peshwa Baji Rao II’ residence, has a beautiful wooden facade with intricately carved brackets and pillars. The Kasba Ganapati Temple, built by Jijabai/Shivaji’s mother, is a central part of the Ganapati Festival.TheKasba Ganapati is Pune's gram devata/village deity/patron deity.",
          "There are several Bazaars or markets here selling a diverse array of products from vegetables to utensils to costume jewellery. They are usually brimming with people and visitors are always recommended to bargain hard before buying any product.A visit to Barud Ali takes you to the community of basket weavers in Pune. The Jyotiba Phule Mandai allows you to experience the vibrant atmosphere of the city’s largest covered market that sells everything.",
          "Next to this is the Bangle Sellers Lane, which has several shops including traditional ones selling a variety of bangles. At Tulshibaug you can visit theTulshibaug RamMandir with its beautiful shikara and the vibrant and bustlingTulshibaug Market. This is a very popular market where you can find a diverse array of knick-knacks and costume jewellery.",
          "Price:This depends on the package you choose."
        ],
        "spans": [],
        "full_text": "It has markets, temples, and places of cultural, religious and historical significance. The Shaniwar Wada was originally a grand palace where the Peshwas lived and looks very much like a fort. The original Lal Mahal (palace) was the residence of Shivaji Bhonsle/Chhatrapati Shivaji Maharaj, and today its replica is seen here. The Nana Wada, made of wood, was the Peshwas’ administrator/Nana Phadnavis’ estate and illustrates the beauty and style of Peshwa-architecture. The Vishrambaug Wada, originally Peshwa Baji Rao II’ residence, has a beautiful wooden facade with intricately carved brackets and pillars. The Kasba Ganapati Temple, built by Jijabai/Shivaji’s mother, is a central part of the Ganapati Festival.TheKasba Ganapati is Pune's gram devata/village deity/patron deity. There are several Bazaars or markets here selling a diverse array of products from vegetables to utensils to costume jewellery. They are usually brimming with people and visitors are always recommended to bargain hard before buying any product.A visit to Barud Ali takes you to the community of basket weavers in Pune. The Jyotiba Phule Mandai allows you to experience the vibrant atmosphere of the city’s largest covered market that sells everything. Next to this is the Bangle Sellers Lane, which has several shops including traditional ones selling a variety of bangles. At Tulshibaug you can visit theTulshibaug RamMandir with its beautiful shikara and the vibrant and bustlingTulshibaug Market. This is a very popular market where you can find a diverse array of knick-knacks and costume jewellery. Price:This depends on the package you choose."
      },
      "link": "https://www.thrillophilia.com/cities/granada/things-to-do"
    },
    {
      "id": "40540",
      "number": "09",
      "title": "Trek To Sinhagad Fort",
      "content": {
        "paragraphs": [
          "Located around 35 kilometres away from Pune in the Sahyadri Mountains, is this majestic 2000-year-old fortress. It houses the Kaundinya Eshwar Temple, some beautifully carved hidden caves, bastions, and tombs of Rajaram Chhatrapati and Tanaji Malusare.A visit to this fort is a great way to spend time in the beautiful surroundings of mountains and lush forests enveloped in the fresh crisp air. Its location at a height of around 750 metres and rugged trails make it a perfect trekking location. A lot of people start this trek early morning to catch the mesmerising hillside sunrise, one of the most amazingthings to do in Pune city. Don’t miss to try local Maharashtrian food like Vada Pav, Pitla, Kanda Bhaji, etc. at the nearby shacks.Location:Sinhagad Ghat Rd, Thoptewadi, Maharashtra 411025Timing:5 am to 6 pm"
        ],
        "spans": [
          "A visit to this fort is a great way to spend time in the beautiful surroundings of mountains and lush forests enveloped in the fresh crisp air. Its location at a height of around 750 metres and rugged trails make it a perfect trekking location. A lot of people start this trek early morning to catch the mesmerising hillside sunrise, one of the most amazing",
          ". Don’t miss to try local Maharashtrian food like Vada Pav, Pitla, Kanda Bhaji, etc. at the nearby shacks.Location:",
          "Timing:5 am to 6 pm"
        ],
        "full_text": "Located around 35 kilometres away from Pune in the Sahyadri Mountains, is this majestic 2000-year-old fortress. It houses the Kaundinya Eshwar Temple, some beautifully carved hidden caves, bastions, and tombs of Rajaram Chhatrapati and Tanaji Malusare.A visit to this fort is a great way to spend time in the beautiful surroundings of mountains and lush forests enveloped in the fresh crisp air. Its location at a height of around 750 metres and rugged trails make it a perfect trekking location. A lot of people start this trek early morning to catch the mesmerising hillside sunrise, one of the most amazingthings to do in Pune city. Don’t miss to try local Maharashtrian food like Vada Pav, Pitla, Kanda Bhaji, etc. at the nearby shacks.Location:Sinhagad Ghat Rd, Thoptewadi, Maharashtra 411025Timing:5 am to 6 pm A visit to this fort is a great way to spend time in the beautiful surroundings of mountains and lush forests enveloped in the fresh crisp air. Its location at a height of around 750 metres and rugged trails make it a perfect trekking location. A lot of people start this trek early morning to catch the mesmerising hillside sunrise, one of the most amazing . Don’t miss to try local Maharashtrian food like Vada Pav, Pitla, Kanda Bhaji, etc. at the nearby shacks.Location: Timing:5 am to 6 pm"
      },
      "link": "https://www.thrillophilia.com/tours/katraj-to-sinhagad-night-trek"
    },
    {
      "id": "52419",
      "number": "10",
      "title": "Visit The Pataleshwar Cave Temple",
      "content": {
        "paragraphs": [],
        "spans": [],
        "full_text": "Situated in the city centre, the Pataleshwar Cave Temple is an ancient place of worship which is frequented by locals as well as other tourists from the rest of India. Paying a visit to this 8th-century structure is among the best things to do in Pune. A dedication to an avatar of Lord Shiva - the Lord of the Underworld, ‘Pataleshwar’, this temple was carved out of a single rock. There is a shrine of Lord Shiva and his ride, Nandi the Bull within. Besides this, there are high arches, and engraved pillars, miniature inscriptions, mandapas, detailed craftsmanship and more that would leave you amazed during your tour here."
      }
    },
    {
      "id": "52425",
      "number": "11",
      "title": "Revitalize at Empress Garden",
      "content": {
        "paragraphs": [],
        "spans": [],
        "full_text": "This botanical garden has existed since the British Rule in India, a dedication to the then heir of the crown Queen Victoria. Spanning over 39 acres of land, the Express Garden is a stunning attraction to enjoy the visuals of a diverse and unique ecosystem. If you have run out of things to do in Pune, consider packing a quick picnic and coming to the Garden. Here one can sit in peace, take a stroll and explore the variety of flora that is harboured within. There are also arrangements of a flower exhibition that one can attend to learn about the foreign and indigenous plants."
      }
    },
    {
      "id": "52424",
      "number": "12",
      "title": "Visit the Historic Lal Mahal",
      "content": {
        "paragraphs": [],
        "spans": [],
        "full_text": "This pivotal landmark sits in the busy area of Pune, close to another iconic attraction - Shaniwarwada. Lal Mahal, deriving its name from its appearance means the Red Palace. Built with red-bricks and maroon hues, this 16th-century palace is an important addition to the Maratha and Peshwa kingdom. This place is also where the Valiant Shivaji Chatrapati Maharaj was born and bred. Today, the monument we see is a reconstruction from 1988 since the original Mahal was torn down in an attack. Hence, with such an elaborate history and anecdotes, one must add a thorough tour of Lal Mahal to their list of things to do in Pune."
      }
    },
    {
      "id": "52423",
      "number": "13",
      "title": "Evening Walk in Saras Garden",
      "content": {
        "paragraphs": [],
        "spans": [],
        "full_text": "The Saras Garden, also known as Saras Baug, is among the top attractions to visit. Surrounded by the thriving fauna, the garden houses the Talyatla Ganpati or a Ganesha Temple which was built by Sawai Madhavrao Peshwa and Mahadji Shinde of the Maratha Clan in 1750. Later a museum was added to the shrine. And now the entire place is well-liked by travellers and locals for walks and bird watching which are the best things to do in Pune in the evening."
      }
    },
    {
      "id": "52422",
      "number": "14",
      "title": "Tour the Raja Dinkar Kelkar Museum",
      "content": {
        "paragraphs": [],
        "spans": [],
        "full_text": "Boasting of spectacular architecture, the Raja Dinkar Kelkar Museum is one of the things to see in Pune if you want to delve into Indian History and explore the fine artefact collections from decades and centuries ago. Housed within the massive establishment are over 20,000 pieces, divided into different exhibits and wings. These collections include the original interiors and furnishing from the Mastani Mahal, Ancient Warfare like darts, swords, spears and shields that were used in actual battles, A Textile Zone which showcases the fashion and styles worn by the royalty of the 15th century and there is still much more that you can discover with a full-day tour here."
      }
    },
    {
      "id": "52421",
      "number": "16",
      "title": "Go For A Picnic At Pashan Lake",
      "content": {
        "paragraphs": [],
        "spans": [],
        "full_text": "This is another one of the colonial era Lakes that was built artificially by the Britishers to meet the water requirements in the region. Located at a distance of 12 kilometres from the Pune city centre, in suburbs of Pashan. The Pashan lake attracts flanks of tourists and locals for its serene ambience, opulent environment, sightings of a variety of birds and other wildlife, as well as many recreational activities. This locale attraction also happens to be one of the best things to see in Pune if you are visiting the city for the very first time. You can take a long stroll here, enjoy overnight camping, boating among much more."
      }
    },
    {
      "id": "52420",
      "number": "17",
      "title": "Explore Khadakwasla Dam",
      "content": {
        "paragraphs": [],
        "spans": [],
        "full_text": "To fight droughts and water scarcity, Khadakwasla Dam was built in 1869 by the British rulers in India. It is situated in the outskirts of Pune, over the Mutha River, which is the main source of water supply to the city. Khadakwalsa over the years has found prominence as one of the topmost things to see in Pune for its sheer beauty, natural sceneries and a laid-back atmosphere. Acting as a reservoir for the Dam is the artificial Khadakwasla lake which is a point for many recreational activities like swimming, boating, angling etc. One can also choose to set camp here, go for nature walks or visit the nearby Sinhagad Fort for the perfect outing."
      }
    },
    {
      "id": "3397",
      "number": "18",
      "title": "Paragliding in Kamshet",
      "content": {
        "paragraphs": [
          "If adventure is\r\nall that keeps you happy then waste no time and head straight to Kamshet.\r\nFulfill your childhood desire of flying high with the birds by enrolling in\r\nparagliding near Pune at this slice of paradise.",
          "Kamshet is a picturesquehill station near Puneand is gradually becoming a favourite a paragliding\r\ndestination for adventure seekers near Pune. Located at a height of around\r\n2200ft above sea level, this stunning place offers idyllic weather and height\r\nconditions for beginners as well as experienced paragliders.",
          "Considering all\r\nthese factors, Kamshet was developed as a flying holiday and adventure\r\ndestination near Pune. With an easy availability of numerous world-class\r\nparagliding facilities, Kamshet has been known for attracting tourists from all\r\nover the nation for this thrilling adventure."
        ],
        "spans": [],
        "full_text": "If adventure is\r\nall that keeps you happy then waste no time and head straight to Kamshet.\r\nFulfill your childhood desire of flying high with the birds by enrolling in\r\nparagliding near Pune at this slice of paradise. Kamshet is a picturesquehill station near Puneand is gradually becoming a favourite a paragliding\r\ndestination for adventure seekers near Pune. Located at a height of around\r\n2200ft above sea level, this stunning place offers idyllic weather and height\r\nconditions for beginners as well as experienced paragliders. Considering all\r\nthese factors, Kamshet was developed as a flying holiday and adventure\r\ndestination near Pune. With an easy availability of numerous world-class\r\nparagliding facilities, Kamshet has been known for attracting tourists from all\r\nover the nation for this thrilling adventure."
      },
      "link": "https://www.thrillophilia.com/hill-stations-near-pune"
    },
    {
      "id": "40935",
      "number": "20",
      "title": "Have Fun at Adlabs Imagica",
      "content": {
        "paragraphs": [
          "Thinking of what to do in Pune? Look no further than Adlabs Imagica. This unique theme park has so much, that it will take days to explore all its attractions! Try amazing indoor & outdoor rides like Happy Wheels, Salimgarh, and Nitro.The water park here takes its inspiration from the beautiful Greek city Mykonos. Try rides like Lazy River, Splash, and Loopy-Woopy. Climb snowy slopes and have a snowball fight right here in Lonavala at the Snow Park as you experience temperatures as low as -5°C. Don’t miss to see Glow Magica, House of Stars, and EyelusionLocation:Off Mumbai-Pune expresswayTimings:10:30 am to  8 pmBook Tickets:Tickets of Imagicaa Theme Park"
        ],
        "spans": [
          "Off Mumbai-Pune expressway"
        ],
        "full_text": "Thinking of what to do in Pune? Look no further than Adlabs Imagica. This unique theme park has so much, that it will take days to explore all its attractions! Try amazing indoor & outdoor rides like Happy Wheels, Salimgarh, and Nitro.The water park here takes its inspiration from the beautiful Greek city Mykonos. Try rides like Lazy River, Splash, and Loopy-Woopy. Climb snowy slopes and have a snowball fight right here in Lonavala at the Snow Park as you experience temperatures as low as -5°C. Don’t miss to see Glow Magica, House of Stars, and EyelusionLocation:Off Mumbai-Pune expresswayTimings:10:30 am to  8 pmBook Tickets:Tickets of Imagicaa Theme Park Off Mumbai-Pune expressway"
      },
      "link": "https://www.thrillophilia.com/tours/imagica-theme-park-entry-pass"
    },
    {
      "id": "40539",
      "number": "23",
      "title": "Have an Enthralling Experience at Della Adventure",
      "content": {
        "paragraphs": [
          "Of all the exciting activities in Pune, this one is going to top the charts! Experience the country’s longest 1250-ft Flying Fox and only 100-ft Swoop Swing at Della Adventure Park. Located in Lonavala, this is one of the largest adventure parks in the area, perfect for shaking your fatigue as you indulge in extreme adventure activities and it is one of the best things to do in Pune.Don’t miss to try other thrilling activities like sky cycling, ATV riding, buggy riding, motocross dirt biking, rappelling, land zorbing, Water Zorb, etc. And the fun doesn’t stop here. Enjoy indoor adventures like Mirror Maze, Pool, Table Tennis, Foosball, and a huge range of virtual games.Location:Lonavla, Kunegaon, Maharashtra 410401Timing:11 am to 9 pm"
        ],
        "spans": [
          "Don’t miss to try other thrilling activities like sky cycling, ATV riding, buggy riding, motocross dirt biking, rappelling, land zorbing, Water Zorb, etc. And the fun doesn’t stop here. Enjoy indoor adventures like Mirror Maze, Pool, Table Tennis, Foosball, and a huge range of virtual games.Location:",
          "Lonavla, Kunegaon, Maharashtra 410401"
        ],
        "full_text": "Of all the exciting activities in Pune, this one is going to top the charts! Experience the country’s longest 1250-ft Flying Fox and only 100-ft Swoop Swing at Della Adventure Park. Located in Lonavala, this is one of the largest adventure parks in the area, perfect for shaking your fatigue as you indulge in extreme adventure activities and it is one of the best things to do in Pune.Don’t miss to try other thrilling activities like sky cycling, ATV riding, buggy riding, motocross dirt biking, rappelling, land zorbing, Water Zorb, etc. And the fun doesn’t stop here. Enjoy indoor adventures like Mirror Maze, Pool, Table Tennis, Foosball, and a huge range of virtual games.Location:Lonavla, Kunegaon, Maharashtra 410401Timing:11 am to 9 pm Don’t miss to try other thrilling activities like sky cycling, ATV riding, buggy riding, motocross dirt biking, rappelling, land zorbing, Water Zorb, etc. And the fun doesn’t stop here. Enjoy indoor adventures like Mirror Maze, Pool, Table Tennis, Foosball, and a huge range of virtual games.Location: Lonavla, Kunegaon, Maharashtra 410401"
      },
      "link": "https://www.thrillophilia.com/tours/della-adventure-park-ticket-and-activities-in-kunegaon-lonavala"
    },
    {
      "id": "40541",
      "number": "26",
      "title": "Stroll At Koregaon Park Road",
      "content": {
        "paragraphs": [
          "One of the most affluent and visited places, Koregaon Park is the go-to place for anybody visiting Pune. It houses some of the best restaurants, pubs, cafes, quirky concept stores, bakeries, etc. Indulge in some of the best fusion foods at Kargo and try gold and pink coloured lattes at One O Eight Café. There are plenty of bars here like Mineority By Saby, Stereo, and the iconic Hard Rock Café.Shopping at Koregaon Park Road is one of the bestthings to do in Pune.There are many new-age clothing stores here  like Enclothe, Adrish, Ka-Sha India, etc. for you to pick up quirky clothes and accessories. Round off the day with a dessert at one of the amazing cake shops like Theobroma, Sweetish House Mafia, Pasteur Bakery, etc.Location:Koregaon Park, PuneTiming:No Timing"
        ],
        "spans": [
          "Shopping at Koregaon Park Road is one of the best",
          "There are many new-age clothing stores here  like Enclothe, Adrish, Ka-Sha India, etc. for you to pick up quirky clothes and accessories. Round off the day with a dessert at one of the amazing cake shops like Theobroma, Sweetish House Mafia, Pasteur Bakery, etc.Location:Koregaon Park, PuneTiming:No Timing"
        ],
        "full_text": "One of the most affluent and visited places, Koregaon Park is the go-to place for anybody visiting Pune. It houses some of the best restaurants, pubs, cafes, quirky concept stores, bakeries, etc. Indulge in some of the best fusion foods at Kargo and try gold and pink coloured lattes at One O Eight Café. There are plenty of bars here like Mineority By Saby, Stereo, and the iconic Hard Rock Café.Shopping at Koregaon Park Road is one of the bestthings to do in Pune.There are many new-age clothing stores here  like Enclothe, Adrish, Ka-Sha India, etc. for you to pick up quirky clothes and accessories. Round off the day with a dessert at one of the amazing cake shops like Theobroma, Sweetish House Mafia, Pasteur Bakery, etc.Location:Koregaon Park, PuneTiming:No Timing Shopping at Koregaon Park Road is one of the best There are many new-age clothing stores here  like Enclothe, Adrish, Ka-Sha India, etc. for you to pick up quirky clothes and accessories. Round off the day with a dessert at one of the amazing cake shops like Theobroma, Sweetish House Mafia, Pasteur Bakery, etc.Location:Koregaon Park, PuneTiming:No Timing"
      }
    },
    {
      "id": "40542",
      "number": "28",
      "title": "Shinde Chhatri",
      "content": {
        "paragraphs": [
          "This is one of Pune’s top attractions, especially for people who like to escape the crowds and noise into a peacefully rustic ambience, characteristic old forts and buildings. This memorial was erected to honour military leader Mahadji Shinde, who served the Peshwa army in the 17th century.The yellow-black architecture has Anglo-Rajasthani influences. The main hall area has a huge sculpture of Mahadji Shinde and a gallery to showcase his life and valour.You will also see elaborately carved pillars, arches, walls adorned by paintings, stained-glass windows and a spiral staircase inside. There is a Shiva Temple with beautiful yellow stone-carved idols.Location:Wanawadi Rd, Pune Cantonment, Pune, Maharashtra 411001Timing:7 am to 8 pm"
        ],
        "spans": [
          "You will also see elaborately carved pillars, arches, walls adorned by paintings, stained-glass windows and a spiral staircase inside. There is a Shiva Temple with beautiful yellow stone-carved idols.Location:",
          "Wanawadi Rd, Pune Cantonment, Pune, Maharashtra 411001"
        ],
        "full_text": "This is one of Pune’s top attractions, especially for people who like to escape the crowds and noise into a peacefully rustic ambience, characteristic old forts and buildings. This memorial was erected to honour military leader Mahadji Shinde, who served the Peshwa army in the 17th century.The yellow-black architecture has Anglo-Rajasthani influences. The main hall area has a huge sculpture of Mahadji Shinde and a gallery to showcase his life and valour.You will also see elaborately carved pillars, arches, walls adorned by paintings, stained-glass windows and a spiral staircase inside. There is a Shiva Temple with beautiful yellow stone-carved idols.Location:Wanawadi Rd, Pune Cantonment, Pune, Maharashtra 411001Timing:7 am to 8 pm You will also see elaborately carved pillars, arches, walls adorned by paintings, stained-glass windows and a spiral staircase inside. There is a Shiva Temple with beautiful yellow stone-carved idols.Location: Wanawadi Rd, Pune Cantonment, Pune, Maharashtra 411001"
      }
    },
    {
      "id": "40543",
      "number": "29",
      "title": "Spend a Cultural Night at Chokhi Dhani",
      "content": {
        "paragraphs": [
          "Soaking in the vibrancy, colours, and cuisines of Rajasthan at Chokhi Dhani is one of the best things to do in Pune. Enjoy reverberating music as you see folk dances like Kalbelia, Ghoomar, and Kachhi Godi performed by dancers adorned in colourful clothes and jewellery. The place is a recreation of a traditional Rajasthani village complete with mud houses, wells, and streets. See rope walkers, potters, and puppeteers here.The highlight of Chokhi Dhani is, of course, the traditional food laden with copious amounts of ghee and spices. Enjoy Bikaner Kachori with Kadhi, Bati, Churma, Bhakri Roti, and the unmissable Garlic chutney. Round off the meal with delicious Malpuas and Gulab Jamuns.Location:Nagar Highway, Wagholi, Pune, Maharashtra 412207Timing:4 pm to 10 pm"
        ],
        "spans": [
          "The highlight of Chokhi Dhani is, of course, the traditional food laden with copious amounts of ghee and spices. Enjoy Bikaner Kachori with Kadhi, Bati, Churma, Bhakri Roti, and the unmissable Garlic chutney. Round off the meal with delicious Malpuas and Gulab Jamuns.Location:",
          "Timing:4 pm to 10 pm"
        ],
        "full_text": "Soaking in the vibrancy, colours, and cuisines of Rajasthan at Chokhi Dhani is one of the best things to do in Pune. Enjoy reverberating music as you see folk dances like Kalbelia, Ghoomar, and Kachhi Godi performed by dancers adorned in colourful clothes and jewellery. The place is a recreation of a traditional Rajasthani village complete with mud houses, wells, and streets. See rope walkers, potters, and puppeteers here.The highlight of Chokhi Dhani is, of course, the traditional food laden with copious amounts of ghee and spices. Enjoy Bikaner Kachori with Kadhi, Bati, Churma, Bhakri Roti, and the unmissable Garlic chutney. Round off the meal with delicious Malpuas and Gulab Jamuns.Location:Nagar Highway, Wagholi, Pune, Maharashtra 412207Timing:4 pm to 10 pm The highlight of Chokhi Dhani is, of course, the traditional food laden with copious amounts of ghee and spices. Enjoy Bikaner Kachori with Kadhi, Bati, Churma, Bhakri Roti, and the unmissable Garlic chutney. Round off the meal with delicious Malpuas and Gulab Jamuns.Location: Timing:4 pm to 10 pm"
      }
    },
    {
      "id": "40546",
      "number": "30",
      "title": "Have a Drink at Independence Brewing Company",
      "content": {
        "paragraphs": [
          "Pune’s most loved microbrewery, Independence Brewing Company, is also one of India’s largest. It offers handcrafted beers introducing people to international standards and tastes. The warm and friendly ambience here gets perfectly complemented by huge mirror walls and leather seating. The outdoor area is lit in twinkling white lights lending it a romantic atmosphere, perfect for couples.Indulge in beers that have hints of citrus, nuts, fruits, honey, and lightly spiced with cloves, cocoa, and vanilla. Pair these amazing drinks with seafood, grill platters, and fusion dishes. The place has huge screens all over. Seeing matches and live events amidst all the energy is one of the bestthings to do in Pune city.Location:79/1, Zero One Complex, Pingale Vasti, Near Passport Seva Kendra, Mundhwa, Pune, Maharashtra 411036Timing:1 pm to 1:30 am"
        ],
        "spans": [
          "Indulge in beers that have hints of citrus, nuts, fruits, honey, and lightly spiced with cloves, cocoa, and vanilla. Pair these amazing drinks with seafood, grill platters, and fusion dishes. The place has huge screens all over. Seeing matches and live events amidst all the energy is one of the best",
          "things to do in Pune city.Location:",
          "Timing:1 pm to 1:30 am"
        ],
        "full_text": "Pune’s most loved microbrewery, Independence Brewing Company, is also one of India’s largest. It offers handcrafted beers introducing people to international standards and tastes. The warm and friendly ambience here gets perfectly complemented by huge mirror walls and leather seating. The outdoor area is lit in twinkling white lights lending it a romantic atmosphere, perfect for couples.Indulge in beers that have hints of citrus, nuts, fruits, honey, and lightly spiced with cloves, cocoa, and vanilla. Pair these amazing drinks with seafood, grill platters, and fusion dishes. The place has huge screens all over. Seeing matches and live events amidst all the energy is one of the bestthings to do in Pune city.Location:79/1, Zero One Complex, Pingale Vasti, Near Passport Seva Kendra, Mundhwa, Pune, Maharashtra 411036Timing:1 pm to 1:30 am Indulge in beers that have hints of citrus, nuts, fruits, honey, and lightly spiced with cloves, cocoa, and vanilla. Pair these amazing drinks with seafood, grill platters, and fusion dishes. The place has huge screens all over. Seeing matches and live events amidst all the energy is one of the best things to do in Pune city.Location: Timing:1 pm to 1:30 am"
      }
    },
    {
      "id": "40544",
      "number": "32",
      "title": "Listen to a Live Gig at Hard Rock Café",
      "content": {
        "paragraphs": [
          "There is always something exciting happening at this iconic café. This is one of the best places to enjoy great food and drinks along with live music & other gigs. The place houses an 80-seater open courtyard with cinema-like setting for people to enjoy the live performances.You can catch local bands belting out music spread across genres like funk, rock, reggae, town hall, etc. HRC also gets many international bands that play Dire Straits, Pink Floyd, Led Zeppelin, and Rolling Stones renditions. Tickle your funny bone as you see live standup comedy acts by comedians, which is one of the most amazingthings to do in Pune at night.Location:Plot no.81/82 East Main Road Koregaon Park, Extn, Pune, Maharashtra 411036Timing:12 pm to 1 am"
        ],
        "spans": [
          "You can catch local bands belting out music spread across genres like funk, rock, reggae, town hall, etc. HRC also gets many international bands that play Dire Straits, Pink Floyd, Led Zeppelin, and Rolling Stones renditions. Tickle your funny bone as you see live standup comedy acts by comedians, which is one of the most amazing",
          ".Location:",
          "Timing:12 pm to 1 am"
        ],
        "full_text": "There is always something exciting happening at this iconic café. This is one of the best places to enjoy great food and drinks along with live music & other gigs. The place houses an 80-seater open courtyard with cinema-like setting for people to enjoy the live performances.You can catch local bands belting out music spread across genres like funk, rock, reggae, town hall, etc. HRC also gets many international bands that play Dire Straits, Pink Floyd, Led Zeppelin, and Rolling Stones renditions. Tickle your funny bone as you see live standup comedy acts by comedians, which is one of the most amazingthings to do in Pune at night.Location:Plot no.81/82 East Main Road Koregaon Park, Extn, Pune, Maharashtra 411036Timing:12 pm to 1 am You can catch local bands belting out music spread across genres like funk, rock, reggae, town hall, etc. HRC also gets many international bands that play Dire Straits, Pink Floyd, Led Zeppelin, and Rolling Stones renditions. Tickle your funny bone as you see live standup comedy acts by comedians, which is one of the most amazing .Location: Timing:12 pm to 1 am"
      }
    },
    {
      "id": "40545",
      "number": "34",
      "title": "Dine at Spice Factory",
      "content": {
        "paragraphs": [
          "This is one of the best dance clubs in Pune known for its amazing ambience, terrific music, great crowds, and of course the huge array of cocktails and food. Try the amazing Blue Devil, Purple Haze, Jagerbomb, and Kamikaze and it is one the best things to do in Pune.The place is famous for its signature shots like Mi A Mi on fire, Flaming Lamborghini, and Mi A Mi Blaze. Pair your drinks with foods like herb-crusted fried fish, lemon basil prawns, lamb meatballs, or Thai spring rolls.Located inside the plush JW Marriott at Shivajinagar, Mi-a-Mi hosts some of the best local and international bands that belt out trance, house, blues, and rock music.For ladies thinking aboutwhat to do in Pune, every Wednesday night here is ‘Ladies night’. One of the best things to do in Pune at nightis having fun with your ‘girlfriends’ and enjoying free drinks at this great club.Location:2nd Floor, White Square, above Vijay Sales, Wakad, Pune, Maharashtra 411057Timing:11:30 am to 2 am"
        ],
        "spans": [
          "Located inside the plush JW Marriott at Shivajinagar, Mi-a-Mi hosts some of the best local and international bands that belt out trance, house, blues, and rock music.",
          "For ladies thinking about",
          "is having fun with your ‘girlfriends’ and enjoying free drinks at this great club.Location:",
          "Timing:11:30 am to 2 am"
        ],
        "full_text": "This is one of the best dance clubs in Pune known for its amazing ambience, terrific music, great crowds, and of course the huge array of cocktails and food. Try the amazing Blue Devil, Purple Haze, Jagerbomb, and Kamikaze and it is one the best things to do in Pune.The place is famous for its signature shots like Mi A Mi on fire, Flaming Lamborghini, and Mi A Mi Blaze. Pair your drinks with foods like herb-crusted fried fish, lemon basil prawns, lamb meatballs, or Thai spring rolls.Located inside the plush JW Marriott at Shivajinagar, Mi-a-Mi hosts some of the best local and international bands that belt out trance, house, blues, and rock music.For ladies thinking aboutwhat to do in Pune, every Wednesday night here is ‘Ladies night’. One of the best things to do in Pune at nightis having fun with your ‘girlfriends’ and enjoying free drinks at this great club.Location:2nd Floor, White Square, above Vijay Sales, Wakad, Pune, Maharashtra 411057Timing:11:30 am to 2 am Located inside the plush JW Marriott at Shivajinagar, Mi-a-Mi hosts some of the best local and international bands that belt out trance, house, blues, and rock music. For ladies thinking about is having fun with your ‘girlfriends’ and enjoying free drinks at this great club.Location: Timing:11:30 am to 2 am"
      }
    },
    {
      "id": "40564",
      "number": "36",
      "title": "Dance at Mi-a-Mi",
      "content": {
        "paragraphs": [
          "This is one of the best dance clubs in Pune known for its amazing ambience, terrific music, great crowds, and of course the huge array of cocktails and food. Try the amazing Blue Devil, Purple Haze, Jagerbomb, and Kamikaze. The place is famous for its signature shots like Mi A Mi on fire, Flaming Lamborghini, and Mi A Mi Blaze. Pair your drinks with foods like herb-crusted fried fish, lemon basil prawns, lamb meatballs, or Thai spring rolls.Located inside the plush JW Marriott at Shivajinagar, Mi-a-Mi hosts some of the best local and international bands that belt out trance, house, blues, and rock music.For ladies thinking aboutwhat to do in Pune, every Wednesday night here is ‘Ladies night’. One of the best things to do in Pune at nightis having fun with your ‘girlfriends’ and enjoying free drinks at this great club.Location:S No. 33, Behind Lokmat Press, Near Rajyog Society, Vadgaon Dhayari,, Sinhgad Rd., Pune, Maharashtra 411041Timing:7 pm to 12 am"
        ],
        "spans": [
          "Located inside the plush JW Marriott at Shivajinagar, Mi-a-Mi hosts some of the best local and international bands that belt out trance, house, blues, and rock music.",
          "For ladies thinking about",
          "is having fun with your ‘girlfriends’ and enjoying free drinks at this great club.Location:",
          "Timing:7 pm to 12 am"
        ],
        "full_text": "This is one of the best dance clubs in Pune known for its amazing ambience, terrific music, great crowds, and of course the huge array of cocktails and food. Try the amazing Blue Devil, Purple Haze, Jagerbomb, and Kamikaze. The place is famous for its signature shots like Mi A Mi on fire, Flaming Lamborghini, and Mi A Mi Blaze. Pair your drinks with foods like herb-crusted fried fish, lemon basil prawns, lamb meatballs, or Thai spring rolls.Located inside the plush JW Marriott at Shivajinagar, Mi-a-Mi hosts some of the best local and international bands that belt out trance, house, blues, and rock music.For ladies thinking aboutwhat to do in Pune, every Wednesday night here is ‘Ladies night’. One of the best things to do in Pune at nightis having fun with your ‘girlfriends’ and enjoying free drinks at this great club.Location:S No. 33, Behind Lokmat Press, Near Rajyog Society, Vadgaon Dhayari,, Sinhgad Rd., Pune, Maharashtra 411041Timing:7 pm to 12 am Located inside the plush JW Marriott at Shivajinagar, Mi-a-Mi hosts some of the best local and international bands that belt out trance, house, blues, and rock music. For ladies thinking about is having fun with your ‘girlfriends’ and enjoying free drinks at this great club.Location: Timing:7 pm to 12 am"
      }
    },
    {
      "id": "40549",
      "number": "43",
      "title": "Visit the Katraj Snake Park",
      "content": {
        "paragraphs": [
          "One of the best activities in Pune is paying a visit to see a huge variety of reptiles, turtles, crocodiles, and even birds at this lush green nature park. This snake park, that became a part of Rajiv Gandhi Zoological Park, houses more than 20 species of snakes. You can see rock pythons, vipers, and tortoises. The major attraction here is a 9 ft. long King Cobra.There is a library inside the park that aims to educate people about reptiles and how can they be treated better. If you visit during Naag Panchami, you can see interesting programs that create awareness about these species through music and theatre performances.Location:Pune Satara Highway, near the Bharati Vidyapeeth University.Timing:10:30 am to 6:00 pm"
        ],
        "spans": [
          "There is a library inside the park that aims to educate people about reptiles and how can they be treated better. If you visit during Naag Panchami, you can see interesting programs that create awareness about these species through music and theatre performances.Location:",
          "Timing:10:30 am to 6:00 pm"
        ],
        "full_text": "One of the best activities in Pune is paying a visit to see a huge variety of reptiles, turtles, crocodiles, and even birds at this lush green nature park. This snake park, that became a part of Rajiv Gandhi Zoological Park, houses more than 20 species of snakes. You can see rock pythons, vipers, and tortoises. The major attraction here is a 9 ft. long King Cobra.There is a library inside the park that aims to educate people about reptiles and how can they be treated better. If you visit during Naag Panchami, you can see interesting programs that create awareness about these species through music and theatre performances.Location:Pune Satara Highway, near the Bharati Vidyapeeth University.Timing:10:30 am to 6:00 pm There is a library inside the park that aims to educate people about reptiles and how can they be treated better. If you visit during Naag Panchami, you can see interesting programs that create awareness about these species through music and theatre performances.Location: Timing:10:30 am to 6:00 pm"
      }
    },
    {
      "id": "52426",
      "number": "44",
      "title": "Indulge in Shopping at Tulsi Baug",
      "content": {
        "paragraphs": [],
        "spans": [],
        "full_text": "To truly capture the essence of this bustling Maharashtrian city, shopping is one of the things to do in Pune. And for the best experience, one has to be at Tulsi Baug, Situated in the very heart of Pune this market gets its name after the nearby Tulsi Baug Wada, a temple dedicated to different Hindu Gods. But over the years, the shopping area has stood its own and made a name among locals as well as tourists for the variety of regional items, clothes, handicrafts, decore, antiques, shoes, jewellery, trinkets and more that are available at bargainous rates."
      }
    },
    {
      "id": "12902",
      "number": "45",
      "title": "Visit Mulshi Lake and Dam",
      "content": {
        "paragraphs": [
          "Looking for a better place to spend yourweekend near Punethen head out to the Mulshi Lake and Dam to spend some alone time along with your family and friends. Mulshi Lake is framed in the catchment zone of Mulshi dam. Known for its beautiful excellence because of Sahyadri ranges, Koraigadh and Dhangad forts, it is an ideal portal for nature lovers. Water from the dam is utilised for the water system and in addition to delivering power at the Bhira hydroelectric power plant, built by Tata Power.",
          "The station works six 25MW Pelton turbines set up in 1927 and one 150MW Pumped Storage Unit. Water from this store situated in Krishna river bowl is occupied by the Bhira control house for producing Hydropower. In 1920-21, amid the development of the dam and power station, Pandurang Mahadev Bapat drove Mulshi Satyagraha, a development to speak to farmers whose land had been taken to construct the venture.",
          "Spend some time witnessing the beauty of nature while you visit this lake. The serenity and the cool breeze will lure you away to some distant land. Click some memorable photographs as you spend some time in the bosom of nature.",
          "Location:Mulshi Dam and Lake is located in the Mulshi taluka administrative division of the Pune district of Maharashtra State."
        ],
        "spans": [],
        "full_text": "Looking for a better place to spend yourweekend near Punethen head out to the Mulshi Lake and Dam to spend some alone time along with your family and friends. Mulshi Lake is framed in the catchment zone of Mulshi dam. Known for its beautiful excellence because of Sahyadri ranges, Koraigadh and Dhangad forts, it is an ideal portal for nature lovers. Water from the dam is utilised for the water system and in addition to delivering power at the Bhira hydroelectric power plant, built by Tata Power. The station works six 25MW Pelton turbines set up in 1927 and one 150MW Pumped Storage Unit. Water from this store situated in Krishna river bowl is occupied by the Bhira control house for producing Hydropower. In 1920-21, amid the development of the dam and power station, Pandurang Mahadev Bapat drove Mulshi Satyagraha, a development to speak to farmers whose land had been taken to construct the venture. Spend some time witnessing the beauty of nature while you visit this lake. The serenity and the cool breeze will lure you away to some distant land. Click some memorable photographs as you spend some time in the bosom of nature. Location:Mulshi Dam and Lake is located in the Mulshi taluka administrative division of the Pune district of Maharashtra State."
      },
      "link": "https://www.thrillophilia.com/one-day-trip-near-pune"
    },
    {
      "id": "40547",
      "number": "46",
      "title": "Witness The Mystique Of The Karla Caves",
      "content": {
        "paragraphs": [
          "Karla Caves, considered to be among the oldest Buddhist shrines in the country, are believed to have been carved in the second century. These majestic structures comprise of the huge Chaitanya hall, ornately carved pillars & walls, and arches. There is a Buddhist monastery here along with a 15-metre-long pillar built in reverence of Goddess Ekveera.There is an ancient trade route located near to this ASI-protected monument. Don’t miss the stupas, pyramids, and rock-cut excavations.Try to identify figures of animals, men, and women intricately carved on the walls. Don’t miss to see the ancient Brahmi script on the walls.Location:Karla, Lonavla, Maharashtra 410405Timing:9 am to 7 pm"
        ],
        "spans": [
          "Try to identify figures of animals, men, and women intricately carved on the walls. Don’t miss to see the ancient Brahmi script on the walls.Location:",
          "Timing:9 am to 7 pm"
        ],
        "full_text": "Karla Caves, considered to be among the oldest Buddhist shrines in the country, are believed to have been carved in the second century. These majestic structures comprise of the huge Chaitanya hall, ornately carved pillars & walls, and arches. There is a Buddhist monastery here along with a 15-metre-long pillar built in reverence of Goddess Ekveera.There is an ancient trade route located near to this ASI-protected monument. Don’t miss the stupas, pyramids, and rock-cut excavations.Try to identify figures of animals, men, and women intricately carved on the walls. Don’t miss to see the ancient Brahmi script on the walls.Location:Karla, Lonavla, Maharashtra 410405Timing:9 am to 7 pm Try to identify figures of animals, men, and women intricately carved on the walls. Don’t miss to see the ancient Brahmi script on the walls.Location: Timing:9 am to 7 pm"
      }
    },
    {
      "id": "12903",
      "number": "47",
      "title": "Enjoy at Appu Ghar Amusement Park",
      "content": {
        "paragraphs": [
          "While you are visiting Pune you would definitely want to explore all the amazing attraction here. Make your day a more exciting one as you visit the famous Appu Ghar Amusement Park. This is another of the best things to do in Pune.  Situated in Nidgi, Pune, Appu Ghar gloats of being the firstamusement park in Pune city. It was initiated on nineteenth November of 1984. This amusement park was named after the mascot of Asian Games of 1982, which were held in Delhi.",
          "An elephant, named Appu was the mascot of the amusements.  Appu Ghar is arranged in Indira Gandhi Udyan, which was at once called as Bund Garden. Often regarded as a small scale Disney place where there is Pune, this place offers countless fun rides and as well as a serene lake and hilly terrains. The vibrant environment of this park combined with various fun rides and amazing facilities make this a standout amongst the most mainstream puts in Pune.",
          "There are rides for each individual, fluctuating from kids rides to exciting for grown-ups.",
          "Rides:Some of the rides here are Appu Columbus, My Fair woman, Roller Coaster, and so forth. For the children, there are rides like Helicopter, Appu Express, Gammat Girki, Merry Go Round, kiddy watercraft, Jumping Frog, Mini Octopus,",
          "Timings:Opens from 12:00 PM to 8:00 PM everyday.",
          "Price:The approximate price for the park is Rs 30 per person (without Rides), Rs 300 per person for Adults (Entry fee along with all Rides and Rs 250 per person for Children",
          "Location:Appu Ghar Amusement park is located at No.23, Pradhikaran Sector, Indira Gandhi Udyan, Nigdi, Near Bhakti Shakti Chowk, Pune, Maharashtra 411044"
        ],
        "spans": [],
        "full_text": "While you are visiting Pune you would definitely want to explore all the amazing attraction here. Make your day a more exciting one as you visit the famous Appu Ghar Amusement Park. This is another of the best things to do in Pune.  Situated in Nidgi, Pune, Appu Ghar gloats of being the firstamusement park in Pune city. It was initiated on nineteenth November of 1984. This amusement park was named after the mascot of Asian Games of 1982, which were held in Delhi. An elephant, named Appu was the mascot of the amusements.  Appu Ghar is arranged in Indira Gandhi Udyan, which was at once called as Bund Garden. Often regarded as a small scale Disney place where there is Pune, this place offers countless fun rides and as well as a serene lake and hilly terrains. The vibrant environment of this park combined with various fun rides and amazing facilities make this a standout amongst the most mainstream puts in Pune. There are rides for each individual, fluctuating from kids rides to exciting for grown-ups. Rides:Some of the rides here are Appu Columbus, My Fair woman, Roller Coaster, and so forth. For the children, there are rides like Helicopter, Appu Express, Gammat Girki, Merry Go Round, kiddy watercraft, Jumping Frog, Mini Octopus, Timings:Opens from 12:00 PM to 8:00 PM everyday. Price:The approximate price for the park is Rs 30 per person (without Rides), Rs 300 per person for Adults (Entry fee along with all Rides and Rs 250 per person for Children Location:Appu Ghar Amusement park is located at No.23, Pradhikaran Sector, Indira Gandhi Udyan, Nigdi, Near Bhakti Shakti Chowk, Pune, Maharashtra 411044"
      },
      "link": "https://www.thrillophilia.com/amusement-parks-in-pune"
    },
    {
      "id": "3833",
      "number": "48",
      "title": "Explore Parvati Hill",
      "content": {
        "paragraphs": [
          "This beautiful lush green hill is one of the prominent Pune visiting places. Not only is the place popular for trekking and escaping into nature, but is famous for its ancient Paravati Temple atop the summit. This temple, located at around 2,100 ft. above sea level, was built during the time of the Peshwas and it is one of the best places in Pune.One of the best activities in Puneis to see the sunset from this hilltop, which is reachable after a climb of around 103 steps. There are also other temples like Devdeveshwar temple, Kartikeya temple, and Vishnu temple at the top. Don’t miss the Peshwa Museum to see pictures and exhibits about the glorious life of Peshwa rulers.Location:Parvati Hill, Parvati Paytha, Pune, Maharashtra 411009.",
          "Timing:The hill is open on all days from 08:00 am to 05:00 pm but the temples will be open from 05:00 am to 08:00 pm.In Pune & want to trek? There are lots oftrekking places in Puneto choose from & fulfill you desire of a funfilled trekking adventure.Also Checkout:Global Village Tickets"
        ],
        "spans": [
          ". Not only is the place popular for trekking and escaping into nature, but is famous for its ancient Paravati Temple atop the summit. This temple, located at around 2,100 ft. above sea level, was built during the time of the Peshwas and it is one of the best places in Pune.One of the best activities in Puneis to see the sunset from this hilltop, which is reachable after a climb of around 103 steps. There are also other temples like Devdeveshwar temple, Kartikeya temple, and Vishnu temple at the top. Don’t miss the Peshwa Museum to see pictures and exhibits about the glorious life of Peshwa rulers.",
          "is to see the sunset from this hilltop, which is reachable after a climb of around 103 steps. There are also other temples like Devdeveshwar temple, Kartikeya temple, and Vishnu temple at the top. Don’t miss the Peshwa Museum to see pictures and exhibits about the glorious life of Peshwa rulers.",
          "In Pune & want to trek? There are lots of"
        ],
        "full_text": "This beautiful lush green hill is one of the prominent Pune visiting places. Not only is the place popular for trekking and escaping into nature, but is famous for its ancient Paravati Temple atop the summit. This temple, located at around 2,100 ft. above sea level, was built during the time of the Peshwas and it is one of the best places in Pune.One of the best activities in Puneis to see the sunset from this hilltop, which is reachable after a climb of around 103 steps. There are also other temples like Devdeveshwar temple, Kartikeya temple, and Vishnu temple at the top. Don’t miss the Peshwa Museum to see pictures and exhibits about the glorious life of Peshwa rulers.Location:Parvati Hill, Parvati Paytha, Pune, Maharashtra 411009. Timing:The hill is open on all days from 08:00 am to 05:00 pm but the temples will be open from 05:00 am to 08:00 pm.In Pune & want to trek? There are lots oftrekking places in Puneto choose from & fulfill you desire of a funfilled trekking adventure.Also Checkout:Global Village Tickets . Not only is the place popular for trekking and escaping into nature, but is famous for its ancient Paravati Temple atop the summit. This temple, located at around 2,100 ft. above sea level, was built during the time of the Peshwas and it is one of the best places in Pune.One of the best activities in Puneis to see the sunset from this hilltop, which is reachable after a climb of around 103 steps. There are also other temples like Devdeveshwar temple, Kartikeya temple, and Vishnu temple at the top. Don’t miss the Peshwa Museum to see pictures and exhibits about the glorious life of Peshwa rulers. is to see the sunset from this hilltop, which is reachable after a climb of around 103 steps. There are also other temples like Devdeveshwar temple, Kartikeya temple, and Vishnu temple at the top. Don’t miss the Peshwa Museum to see pictures and exhibits about the glorious life of Peshwa rulers. In Pune & want to trek? There are lots of"
      },
      "link": "https://www.thrillophilia.com/trekking-in-pune"
    },
    {
      "id": "12904",
      "number": "49",
      "title": "Seek Blessings at Dagdusheth Halwai Temple",
      "content": {
        "paragraphs": [
          "If you are a Ganapati Bhakt and looking for some holy and spiritual place to visit while you are in Pune than Dagdusheth Halwai Temple is one of the must things to do in Pune. Shreemant Dagdusheth Halwai Ganapati is the exemplification of pride and respect to the city of Pune. Devotees from all aspects of India and the world come to go to Lord Ganapati here consistently. Dagdusheth Halwai Mandir is today, not just a standout amongst the most profoundly loved spots of worship in India but also a social organisation effectively occupied with social welfare and social advancement through Dagduseth Halwai Sarvajanik Ganapati Trust.",
          "The temple talks about a long and grand history of the past and imbibes people with knowledge. The deity of Lord Ganesha was incepted by Shri Dagdusheth Halwai and his wife Lakshmibai route back when they lost their lone child to the torment plague. Here every year the Ganapati festival is celebrated with lots of enthusiasm not only by the Dagdusheth’s family but the entire neighbourhood.",
          "Timings:Opens from 6:00 AM to 10:00 PM.",
          "Location:Dagdusheth Halwai Temple is located at Ganpati Bhavan, 250, Budhvar Peth, Shivaji Road, Pune, Maharashtra 411002"
        ],
        "spans": [],
        "full_text": "If you are a Ganapati Bhakt and looking for some holy and spiritual place to visit while you are in Pune than Dagdusheth Halwai Temple is one of the must things to do in Pune. Shreemant Dagdusheth Halwai Ganapati is the exemplification of pride and respect to the city of Pune. Devotees from all aspects of India and the world come to go to Lord Ganapati here consistently. Dagdusheth Halwai Mandir is today, not just a standout amongst the most profoundly loved spots of worship in India but also a social organisation effectively occupied with social welfare and social advancement through Dagduseth Halwai Sarvajanik Ganapati Trust. The temple talks about a long and grand history of the past and imbibes people with knowledge. The deity of Lord Ganesha was incepted by Shri Dagdusheth Halwai and his wife Lakshmibai route back when they lost their lone child to the torment plague. Here every year the Ganapati festival is celebrated with lots of enthusiasm not only by the Dagdusheth’s family but the entire neighbourhood. Timings:Opens from 6:00 AM to 10:00 PM. Location:Dagdusheth Halwai Temple is located at Ganpati Bhavan, 250, Budhvar Peth, Shivaji Road, Pune, Maharashtra 411002"
      }
    },
    {
      "id": "40548",
      "number": "50",
      "title": "Explore Rajiv Gandhi Zoological Park",
      "content": {
        "paragraphs": [
          "Spending time amidst nature and wildlife at Rajiv Gandhi Zoological Park is one of the best things to do in Pune. The way this zoo is segregated is quite interesting. It is divided into the zoo, a snake park, animal orphanage, and the Kartaj Lake area. The lake area is great to have a day picnic and spend time around the calm waters.The park houses more than 350 animals like sloth bears, blackbucks, barking deer, pythons, vipers, etc. Don’t miss to see the huge variety of colourful birds here. The animal orphanage is where abandoned and sick animals are treated. You can also adopt an animal here and support its food and treatment.Location:Pune-Satara Road, Opp. Katraj Dairy, Katraj, Pune, Maharashtra 411046Timing:9:30 am to 5 pm"
        ],
        "spans": [
          "The park houses more than 350 animals like sloth bears, blackbucks, barking deer, pythons, vipers, etc. Don’t miss to see the huge variety of colourful birds here. The animal orphanage is where abandoned and sick animals are treated. You can also adopt an animal here and support its food and treatment.Location:",
          "Timing:9:30 am to 5 pm"
        ],
        "full_text": "Spending time amidst nature and wildlife at Rajiv Gandhi Zoological Park is one of the best things to do in Pune. The way this zoo is segregated is quite interesting. It is divided into the zoo, a snake park, animal orphanage, and the Kartaj Lake area. The lake area is great to have a day picnic and spend time around the calm waters.The park houses more than 350 animals like sloth bears, blackbucks, barking deer, pythons, vipers, etc. Don’t miss to see the huge variety of colourful birds here. The animal orphanage is where abandoned and sick animals are treated. You can also adopt an animal here and support its food and treatment.Location:Pune-Satara Road, Opp. Katraj Dairy, Katraj, Pune, Maharashtra 411046Timing:9:30 am to 5 pm The park houses more than 350 animals like sloth bears, blackbucks, barking deer, pythons, vipers, etc. Don’t miss to see the huge variety of colourful birds here. The animal orphanage is where abandoned and sick animals are treated. You can also adopt an animal here and support its food and treatment.Location: Timing:9:30 am to 5 pm"
      }
    },
    {
      "id": "12901",
      "number": "51",
      "title": "Visit National War Museum",
      "content": {
        "paragraphs": [
          "A popular attraction in Pune, National War Museum is dedicated to the country’s war heroes in the post-Independence era. It is quite a unique self-funded initiative built by the locals of the city. You can see interesting pictures, memorabilia, murals, and documents related to Maratha Kings, Kargil war, and other defence events.The major attraction here is a MIG 23 BN Jet used in the Kargil War along with a replica of INS Trishul and even captured Pakistani Patton Tanks. You can see models of different kinds of guns, rocket launchers, and other artillery here. There is a shooting area where you can try your hand on paintball.Location:National War Museum is located at Prince Of Wales Drive, Ghorpuri Lines, Dobarvadi, Ghorpadi, Pune, Maharashtra 411001Timings:Opens from 9:30 AM–12:30 PM and 3:00 PM –7:00 PM"
        ],
        "spans": [
          "The major attraction here is a MIG 23 BN Jet used in the Kargil War along with a replica of INS Trishul and even captured Pakistani Patton Tanks. You can see models of different kinds of guns, rocket launchers, and other artillery here. There is a shooting area where you can try your hand on paintball.",
          "National War Museum is located at Prince Of Wales Drive, Ghorpuri Lines, Dobarvadi, Ghorpadi, Pune, Maharashtra 411001"
        ],
        "full_text": "A popular attraction in Pune, National War Museum is dedicated to the country’s war heroes in the post-Independence era. It is quite a unique self-funded initiative built by the locals of the city. You can see interesting pictures, memorabilia, murals, and documents related to Maratha Kings, Kargil war, and other defence events.The major attraction here is a MIG 23 BN Jet used in the Kargil War along with a replica of INS Trishul and even captured Pakistani Patton Tanks. You can see models of different kinds of guns, rocket launchers, and other artillery here. There is a shooting area where you can try your hand on paintball.Location:National War Museum is located at Prince Of Wales Drive, Ghorpuri Lines, Dobarvadi, Ghorpadi, Pune, Maharashtra 411001Timings:Opens from 9:30 AM–12:30 PM and 3:00 PM –7:00 PM The major attraction here is a MIG 23 BN Jet used in the Kargil War along with a replica of INS Trishul and even captured Pakistani Patton Tanks. You can see models of different kinds of guns, rocket launchers, and other artillery here. There is a shooting area where you can try your hand on paintball. National War Museum is located at Prince Of Wales Drive, Ghorpuri Lines, Dobarvadi, Ghorpadi, Pune, Maharashtra 411001"
      }
    }
  ]
}